In [1]:
!pip install ipython-sql

%load_ext sql
!env | grep POST
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
WARNING: There was an error checking the latest version of pip.
POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [10]:
%%sql $CONNECT_DATA
SELECT passenger_name, departure_airport, arrival_airport
FROM (
    SELECT ticket_no, flight_id
    FROM Ticket_flights
    WHERE ticket_no = '0005432312164'
) AS tf
JOIN (
    SELECT ticket_no, passenger_name
    FROM Tickets
) AS t ON tf.ticket_no = t.ticket_no
JOIN (
    SELECT flight_id, departure_airport, arrival_airport
    FROM Flights
) AS f ON tf.flight_id = f.flight_id;

4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

In [11]:
%%sql $CONNECT_DATA
SELECT passenger_name, departure_airport, arrival_airport
FROM Flights, Ticket_flights, Tickets
WHERE Flights.flight_id = Ticket_flights.flight_id
  AND Ticket_flights.ticket_no = Tickets.ticket_no
  AND Ticket_flights.ticket_no = '0005432312164';

4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

In [12]:
%%sql $CONNECT_DATA
SELECT passenger_name, departure_airport, arrival_airport
FROM Flights
JOIN Ticket_flights ON Flights.flight_id = Ticket_flights.flight_id
JOIN Tickets ON Ticket_flights.ticket_no = Tickets.ticket_no
WHERE Tickets.ticket_no = '0005432312164';

4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

In [2]:
%%sql $CONNECT_DATA
SELECT dep.city AS departure_city, arr.city AS arrival_city
FROM Flights
JOIN Ticket_flights USING (flight_id)
JOIN Tickets USING (ticket_no)
JOIN Airports AS dep ON Flights.departure_airport = dep.airport_code
JOIN Airports AS arr ON Flights.arrival_airport = arr.airport_code
WHERE Tickets.passenger_name = 'ELLA DMITRIEVA'
LIMIT 10;

7 rows affected.

[('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg'),
 ('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow')]

In [5]:
%%sql $CONNECT_DATA
SELECT Aircrafts.model AS aircraft_model, COUNT(Seats.seat_no) AS total_seats
FROM Aircrafts
JOIN Seats ON Aircrafts.aircraft_code = Seats.aircraft_code
GROUP BY Aircrafts.model
ORDER BY total_seats;

9 rows affected.

[('Cessna 208 Caravan', 12),
 ('Bombardier CRJ-200', 50),
 ('Sukhoi Superjet-100', 97),
 ('Airbus A319-100', 116),
 ('Boeing 737-300', 130),
 ('Airbus A320-200', 140),
 ('Airbus A321-200', 170),
 ('Boeing 767-300', 222),
 ('Boeing 777-300', 402)]